RoanBrand/espix/sdkconfig.defaults.esp32s31
# espix — ESP32-S31 with in-package PSRAM (WROOM-3: 16 MB flash, 8/16 MB PSRAM).
#
# The PSRAM is always octal and always 250 MHz (there is no mode or speed to
# choose), and IDF detects its size at runtime, so there is no compile-time
# difference between the PSRAM variants -- which is why the board identity is
# plain `s31`, with no PSRAM suffix. The image is built for the WROOM-3's 16 MB
# flash; the loader provisions the partition table for whatever flash it finds,
# from the 8, 16 and 32 MB tables it carries.

CONFIG_IDF_TARGET="esp32s31"

#
# Flash
#
# The WROOM-3 is a 16 MB part, and IDF puts the flash size in the image header and
# refuses to probe a chip larger than it. The image is still flashed with the
# smallest table (8 MB), which is valid on any larger chip; the loader writes the
# table that matches the physical flash. See docs/OTA.md 11.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/esp32s31-8mb.csv"
# DIO, IDF's own default for this target (the S3 uses QIO).
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

#
# PSRAM — apps are loaded here, so it is not optional on this target.
#
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# XIP-from-PSRAM is inherited from the target-independent defaults (it is what
# closes the flash-cache crash documented there).
# Load relocated ELF text/data into PSRAM (this is the elf_loader, not XIP).
# There is no bus-address mirror to rely on as on the S3; the component
# handles the target itself.
#
CONFIG_ELF_LOADER_LOAD_PSRAM=y

#
# CPU
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_320=y

#
# Networking: the S31 has a Gigabit Ethernet MAC. The option lives in
# components/espix_net/Kconfig and is on by default wherever SOC_EMAC_SUPPORTED.
#
CONFIG_ESPIX_ETH_ENABLED=y

#
# Bluetooth -- the S31 has Classic as well as BLE, which the S3 does not, so
# A2DP/HFP live here. Bluedroid is the host that supports Classic.
#
CONFIG_ESPIX_BT=y
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_BLE_ENABLED=n
# Classic only: the controller must be in BR/EDR mode for A2DP (IDF's own
# a2dp_source example sets these three for exactly this reason).
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=n
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BTDM_CTRL_MODE_BTDM=n
